///** @file
//  
//    String definitions for BdsPlatform formset.
//  
//  Copyright (c) 2004 - 2010, Intel Corporation. All rights reserved.<BR>
//  This program and the accompanying materials
//  are licensed and made available under the terms and conditions of the BSD License
//  which accompanies this distribution.  The full text of the license may be found at
//  http://opensource.org/licenses/bsd-license.php
//  
//  THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
//  WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//  
//**/

/=#

#langdef   en-US "English"

#string STR_INTERNAL_EFI_SHELL         #language en-US  "[Internal EFI Shell]"
#string STR_LEGACY_BOOT_A              #language en-US  "[Internal Legacy Boot A:]"
#string STR_PROCESSED_ALL_BOOT_OPTIONS #language en-US  "[ProcessedAllBootOptions(): Load shell from the FV]"
#string STR_BOOT_FAILED                #language en-US  "Boot Failed. "
#string STR_BOOT_SUCCEEDED             #language en-US  "Boot Succeeded - "
#string STR_DEFAULT_TIMEOUT_BANNER     #language en-US  "Default boot selection will be booted in "
#string STR_SECONDS                    #language en-US  " seconds"
#string STR_EXIT_DATA                  #language en-US  "ExitData: "
#string STR_LOADING                    #language en-US  "Loading: "
#string STR_ENTER_NORMAL_BOOT          #language en-US  "Entering Normal Boot Process..."
#string STR_PERFORM_MEM_TEST           #language en-US  "Perform memory test (ESC to skip)"
#string STR_MEMORY_TEST_PERCENT        #language en-US  "% of the system memory tested OK"
#string STR_ESC_TO_SKIP_MEM_TEST       #language en-US  "Press ESC key to skip memory test"
#string STR_MEM_TEST_COMPLETED         #language en-US  " bytes of system memory tested OK\r\n"
#string STR_NO_EXT_MEM_FOUND           #language en-US  "Memory resource updated!"
#string STR_SYSTEM_MEM_ERROR           #language en-US  "System encounters memory errors"
#string STR_START_BOOT_OPTION          #language en-US  "Start boot option"
